import moment from 'moment-timezone';
var handler = async (m, {  
      command, 
      conn, 
      args,  
      usedPrefix,  
      text
  }) => {  
    const d = new Date(new Date() + 3600000); 
   const locale = "es"; 
   const week = d.toLocaleDateString(locale, {weekday: "long"}); 
   const date = d.toLocaleDateString(locale, {day: "numeric", month: "long", year: "numeric"}); 
   const _uptime = process.uptime() * 1000; 
   const uptime = clockString(_uptime); 
   const {exp, limit, dolares, role} = global.db.data.users[m.sender]; 
   const who = m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender; 
   const username = conn.getName(who); 
   let pp = await conn.profilePictureUrl(conn.user.jid).catch(_ => 'https://telegra.ph/file/24fa902ead26340f3df2c.png')
   const fload = { key : { remoteJid: 'status@broadcast', participant : '0@s.whatsapp.net' }, message: { orderMessage: { itemCount : 2023, status: 1, surface : 1, message: '[ 𝐂𝐀𝐑𝐆𝐀𝐍𝐃𝐎 𝐌𝐄𝐍𝐔... ]', orderTitle: `▮Menu ▸`, thumbnail: await (await fetch(pp)).buffer(), sellerJid: '0@s.whatsapp.net' 
    }
    }
    }
   const db = "./galeria/menudorrat3.jpg"
  
if (command == "menu" || command == "menú") {
let uwu = `—————————×∆×———————————
┃│⋟ *${ucapan()}*
┃│⋟ *tenemos varios tipos de menus*
┃│⋟ 1
┃│⋟ *#menucompleto*
┃│⋟ 2
┃│⋟ *#descargasmenu*
┃╰══ ⪨`

await conn.sendMessage(m.chat, {   
  text: uwu,  
  contextInfo:{  
  forwardingScore: 9999999,  
  isForwarded: true,   
  mentionedJid:[m.sender],  
  "externalAdReply": {  
  "showAdAttribution": true,  
  "containsAutoReply": true,
  "renderLargerThumbnail": true,  
  "title": wm,   
  "containsAutoReply": true,  
  "mediaType": 1,   
  "thumbnail": fotogodzx,  
  "mediaUrl": `https://chat.whatsapp.com/CMABi78Vd9xH8aNF73eE2x`,  
  "sourceUrl": `https://chat.whatsapp.com/CMABi78Vd9xH8aNF73eE2x`  
  }  
  }  
  }, { quoted: m })
}  
if (command == "menucompleto" || command == "allmenu") {
await m.reply(`[ 𝐂𝐀𝐑𝐆𝐀𝐍𝐃𝐎 𝐌𝐄𝐍𝐔... ]`);                 
var completomenu = `*╭━━❍𝐁𝐨𝐭𝐀𝐱𝐱𝐜❍━━╮* 
 *┣━━━▢ ❤𝐇𝐎𝐋𝐀, ${username}❤*• 
 *┃╭━━━━━━━━━━━━━━━━╾•* 
 *┃┃  ❍ ${ucapan()} ❍* 
 *┃┣━━━━━━━━━━━━━━━━╾•* 
 *┃┃ ⋄ ADQUIRIR BOT A: wa.me/8123422244   (𝐍𝐎 𝐁𝐎𝐓)* 
 *┃┃ ⋄ VERSION » ${vs}* 
 *┃┃ ⋄ FECHA » ${week}, ${date}* 
 *┃┃ ⋄ TIEMPO ACTIVO » ${uptime}* 
 *┃┃ ⋄ LIBRERIA » ${library}* 
 *┃┃ ⋄ USUARIOS » ${Object.keys(global.db.data.users).length}* 
 *┃╰━━━━━━━━━━━━━━━━╾* 
 
  
 ▧ 「 *I N F O R M A C I O N* 「「
 ‣ Comando: ${usedPrefix}estado
 ‣ Descripción: Mirar el estado del bot
 ‣ Comando: ${usedPrefix}owner
 ‣ Descripción: Información sobre el creador
 ‣ comando: _Bot_ (𝑢𝑠𝑜 𝑠𝑖𝑛 𝑝𝑟𝑒𝑓𝑖𝑗𝑜) 
 ‣ Descripción: info del bot
 └──···

 ╔═════════════╗  
 ║ *<COMPRA UN BOT A TU GRUPO/>* 
 ║══════════════════ 
 ║ ➱_${usedPrefix}join *link del grupo*_  
 ║ ➱_*minimo 30 miembros*_ 
 ╚════ ≪ 𖡽𖡽 ≫ ════╝ 

╭─────────────◆ 
┃✯----𝐈𝐍𝐅𝐎 𝐁𝐎𝐓----⦿
┃ ✯╭──────────◆
┃ ✯│▢/ᴇsᴛᴀᴅᴏ
┃ ✯│▢/sᴘᴇᴇᴅᴛᴇsᴛ
┃ ✯│▢/ᴏᴡɴᴇʀ
┃ ✯│▢/sᴄʀɪᴘᴛ
┃ ✯│▢/ʙᴏᴛ (𝑢𝑠𝑜 𝑠𝑖𝑛 𝑝𝑟𝑒𝑓𝑖𝑗𝑜)
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯----𝐔𝐍𝐄 𝐀𝐋 𝐁𝐎𝐓----⦿
┃ ✯╭──────────◆
┃ ✯│▢/ᴊᴏɪɴ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷

╭─────────────◆ 
┃✯-𝐀𝐂𝐓𝐈𝐕𝐀𝐑 𝐎 𝐃𝐄𝐒𝐀𝐂𝐓𝐈𝐕𝐀𝐑-⦿
┃ ✯╭──────────◆
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴡᴇʟᴄᴏᴍᴇ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴡᴇʟᴄᴏᴍᴇ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴍᴏᴅᴏʜᴏʀɴʏ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴍᴏᴅᴏʜᴏʀɴʏ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪʟɪɴᴋ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪʟɪɴᴋ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪʟɪɴᴋ2
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪʟɪɴᴋ2
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴅᴇᴛᴇᴄᴛ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴅᴇᴛᴇᴄᴛ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀᴜᴅɪᴏs
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀᴜᴅɪᴏs
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴠɪᴇᴡᴏɴᴄᴇ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴠɪᴇᴡᴏɴᴄᴇ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴛᴏxɪᴄ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴛᴏxɪᴄ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴛʀᴀʙᴀ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴛʀᴀʙᴀ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴀʀᴀʙᴇs
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴀʀᴀʙᴇs
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴍᴏᴅᴏᴀᴅᴍɪɴ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴍᴏᴅᴏᴀᴅᴍɪɴ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯-𝐑𝐄𝐏𝐎𝐑𝐓𝐄 𝐄𝐑𝐑𝐎𝐑𝐄𝐒-⦿
┃ ✯╭──────────◆
┃ ✯│▢/ʀᴇᴘᴏʀᴛᴇ➟ᴛᴇxᴛᴏ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯----𝐃𝐄𝐒𝐂𝐀𝐑𝐆𝐀𝐒----⦿
┃ ✯╭──────────◆
┃ ✯│▢/ɪɴsᴛᴀɢʀᴀᴍ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ɪɴsᴛᴀɢʀᴀᴍ2➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ɪɴsᴛᴀɢʀᴀᴍ3➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ᴍᴇᴅɪᴀғɪʀᴇ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ɪɴsᴛᴀɢʀᴀᴍ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ɢɪᴛᴄʟᴏɴᴇ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ɢᴅʀɪᴠᴇ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ᴛɪᴋᴛᴏᴋ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/xɴxxᴅʟ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/xᴠɪᴅᴇᴏsᴅʟ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ᴛᴡɪᴛᴛᴇʀ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ғʙ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ғʙ2➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ғʙ3➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ғʙ4➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ғʙ5➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ʏᴛᴍᴘ3➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ʏᴛᴍᴘ4➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ʏᴛᴍᴘ3ᴅᴏᴄ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ʏᴛᴍᴘ4ᴅᴏᴄ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ᴅᴀᴘᴋ2➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/sᴛɪᴄᴋᴇʀᴘᴀᴄᴋ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/ᴘʟᴀʏ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴘʟᴀʏ.1➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴘʟᴀʏ.2➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴘʟᴀʏᴅᴏᴄ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴘʟᴀʏʟɪsᴛ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴘʟᴀʏʟɪsᴛ2➟ᴛᴇxᴛᴏ
┃ ✯│▢/sᴘᴏᴛɪғʏ➟ᴛᴇxᴛᴏ
┃ ✯│▢/sᴛɪᴄᴋᴇʀʟʏ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʀɪɴɢᴛᴏɴᴇ➟ᴛᴇxᴛᴏ
┃ ✯│▢/sᴏᴜɴᴅᴄʟᴏᴜᴅ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ɪᴍᴀɢᴇɴ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴘɪɴᴛᴇʀᴇsᴛ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴡᴀʟʟᴘᴀᴘᴇʀ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴡᴀʟʟᴘᴀᴘᴇʀ2➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴘᴘᴛɪᴋᴛᴏᴋ➟ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ
┃ ✯│▢/ɪɢsᴛᴀʟᴋ➟ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ
┃ ✯│▢/ɪɢsᴛᴏʀʏ➟ɴᴏᴍʙʀᴇ ᴅᴇ ᴜsᴜᴀʀɪᴏ
┃ ✯│▢/ᴛɪᴋᴛᴏᴋsᴛᴀʟᴋ➟ᴜsᴇʀɴᴀᴍᴇ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯----𝐆𝐑𝐔𝐏𝐎𝐒----⦿
┃ ✯╭──────────◆
┃ ✯│▢/ᴀᴅᴅ➟ɴᴜᴍᴇʀᴏ
┃ ✯│▢/ᴋɪᴄᴋ➟@ᴛᴀɢ
┃ ✯│▢/ᴋɪᴄᴋ2➟@ᴛᴀɢ
┃ ✯│▢/ʟɪsᴛᴀɴᴜᴍ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴋɪᴄᴋɴᴜᴍ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ɢʀᴜᴘᴏ➟ᴀʙʀɪʀ➟ᴄᴇʀʀᴀʀ
┃ ✯│▢/ɢʀᴏᴜᴘᴛɪᴍᴇ➟ᴏᴘᴄɪᴏɴ➟ᴛɪᴇᴍᴘᴏ
┃ ✯│▢/ᴘʀᴏᴍᴏᴛᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴅᴇᴍᴏᴛᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴀᴅᴍɪɴs➟ᴛᴇxᴛᴏ➟𝑢𝑠𝑜 𝑠𝑖𝑛 𝑝𝑟𝑒𝑓𝑖𝑗𝑜
┃ ✯│▢/ᴅᴇᴍᴏᴛᴇ➟@ᴛᴀɢ
┃ ✯│▢/ɪɴғᴏɢʀᴏᴜᴘ
┃ ✯│▢/ʀᴇsᴇᴛʟɪɴᴋ
┃ ✯│▢/ʟɪɴᴋ
┃ ✯│▢/sᴇᴛɴᴀᴍᴇ➟ᴛᴇxᴛᴏ
┃ ✯│▢/sᴇᴛᴅᴇsᴄ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ɪɴᴠᴏᴄᴀʀ➟ᴛᴇxᴛᴏ
┃ ✯│▢/sᴇᴛᴡᴇʟᴄᴏᴍᴇ➟ᴛᴇxᴛᴏ
┃ ✯│▢/sᴇᴛʙʏᴇ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʜɪᴅᴇᴛᴀɢ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʜɪᴅᴇᴛᴀɢ➟ᴀᴜᴅɪᴏ
┃ ✯│▢/ʜɪᴅᴇᴛᴀɢ➟ᴠɪᴅᴇᴏ
┃ ✯│▢/ʜɪᴅᴇᴛᴀɢ➟ɪᴍᴀɢᴇɴ
┃ ✯│▢/ᴡᴀʀɴ➟@ᴛᴀɢ
┃ ✯│▢/ᴜɴᴡᴀʀɴ➟@ᴛᴀɢ
┃ ✯│▢/ʟɪsᴛᴡᴀʀɴ
┃ ✯│▢/ғᴀɴᴛᴀsᴍᴀs
┃ ✯│▢/ᴅᴇsᴛʀᴀʙᴀ
┃ ✯│▢/sᴇᴛᴘᴘ➟ɪᴍᴀɢᴇɴ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯----𝐉𝐔𝐄𝐆𝐎𝐒----⦿
┃ ✯╭──────────◆
┃ ✯│▢/ᴍᴀᴛᴇs➟ɴᴏᴏʙ➟ᴇᴀsʏ➟ᴍᴇᴅɪᴜᴍ➟ʜᴀʀᴅ➟ᴇxᴛʀᴇᴍᴇ➟ɪᴍᴘᴏssɪʙʟᴇ➟ɪᴍᴘᴏssɪʙʟᴇ2
┃ ✯│▢/ᴘᴘᴛ➟ᴘᴀᴘᴇʟ➟ᴛɪᴊᴇʀᴀ➟ᴘɪᴇᴅʀᴀ
┃ ✯│▢/ᴘʀᴏsᴛɪᴛᴜᴛᴏ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴘʀᴏsᴛɪᴛᴜᴛᴀ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ɢᴀʏ2➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ʟᴇsʙɪᴀɴᴀ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴘᴀᴊᴇʀᴏ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴘᴀᴊᴇʀᴀ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴘᴜᴛᴏ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴘᴜᴛᴀ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴍᴀɴᴄᴏ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴍᴀɴᴄᴀ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ʀᴀᴛᴀ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ʟᴏᴠᴇ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴅᴏxᴇᴀʀ➟ɴᴏᴍʙʀᴇ➟@ᴛᴀɢ
┃ ✯│▢/ᴘʀᴇɢᴜɴᴛᴀ➟ᴛᴇxᴛᴏ
┃ ✯│▢/sᴜɪᴛᴘᴠᴘ➟@ᴛᴀɢ
┃ ✯│▢/sʟᴏᴛ➟ᴀᴘᴜᴇsᴛᴀ
┃ ✯│▢/ᴛᴛᴛ➟ɴᴏᴍʙʀᴇ➟sᴀʟᴀ
┃ ✯│▢/ᴅᴇʟᴛᴛᴛ
┃ ✯│▢/ᴀᴄᴇʀᴛɪᴊᴏ
┃ ✯│▢/sɪᴍɪ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴛᴏᴘ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴛᴏᴘ➟ɢᴀʏs
┃ ✯│▢/ᴛᴏᴘᴏ➟ᴛᴀᴋᴜs
┃ ✯│▢/ғᴏʀᴍᴀʀᴘᴀʀᴇᴊᴀ
┃ ✯│▢/ᴠᴇʀᴅᴀᴅ
┃ ✯│▢/ʀᴇᴛᴏ
┃ ✯│▢/ᴄᴀɴᴄɪᴏɴ
┃ ✯│▢/ᴘɪsᴛᴀ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯-𝐂𝐎𝐍𝐕𝐄𝐑𝐓𝐈𝐃𝐎𝐑𝐄𝐒-⦿
┃ ✯╭──────────◆
┃ ✯│▢/ᴛᴏɢɪғᴀᴜᴅ➟ᴠɪᴅᴇᴏ
┃ ✯│▢/ᴛᴏɪᴍɢ➟sᴛɪᴄᴋᴇʀ
┃ ✯│▢/ᴛᴏᴍᴘ3➟ᴠɪᴅᴇᴏ
┃ ✯│▢/ᴛᴏᴍᴘ3➟ɴᴏᴛᴀ➟ᴅᴇ➟ᴠᴏᴢ
┃ ✯│▢/ᴛᴏᴘᴛᴛ➟ᴠɪᴅᴇᴏ➟ᴀᴜᴅɪᴏ
┃ ✯│▢/ᴛᴏᴠɪᴅᴇᴏ➟sᴛɪᴄᴋᴇʀ
┃ ✯│▢/ᴛᴏᴜʀʟ➟ᴠɪᴅᴇᴏ➟ɪᴍᴀɢᴇɴ➟ᴀᴜᴅɪᴏ
┃ ✯│▢/ᴛᴛs➟ᴇs➟ᴛᴇxᴛᴏ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯-𝐄𝐅𝐄𝐂𝐓𝐎𝐒 𝐘 𝐋𝐎𝐆𝐎𝐒-⦿
┃ ✯╭──────────◆
┃ ✯│▢𝐄𝐅𝐄𝐂𝐓𝐎𝐒 𝐘 𝐋𝐎𝐆𝐎𝐒
┃ ✯│▢/ᴘʜᴍᴀᴋᴇʀ➟ᴏᴘᴄɪᴏɴ➟ɪᴍᴀɢᴇɴ
┃ ✯│▢/ʟᴏɢᴏs➟ᴇғᴇᴄᴛᴏ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʟᴏɢᴏᴄʜʀɪsᴛᴍᴀs➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʟᴏɢᴏᴄᴏʀᴀᴢᴏɴ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʏᴛᴄᴏᴍᴍᴇɴᴛ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʜᴏʀɴʏᴄᴀʀᴅ➟@ᴛᴀɢ
┃ ✯│▢/sɪᴍᴘᴄᴀʀᴅ➟@ᴛᴀɢ
┃ ✯│▢/ʟᴏʟɪᴄᴇ➟@ᴛᴀɢ
┃ ✯│▢/ɪᴛssᴏsᴛᴜᴘɪᴅ
┃ ✯│▢/ᴘɪxᴇʟᴀʀ
┃ ✯│▢/ʙʟᴜʀ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯----𝐀𝐍𝐈𝐌𝐄----⦿
┃ ✯╭──────────◆
┃ ✯│▢/ʜᴀᴅᴇs
┃ ✯│▢/ʜᴇʟᴀɪʟᴀ
┃ ✯│▢/ɢᴀᴡʀɢᴜʀᴀ
┃ ✯│▢/ᴄʀɪsᴛɪᴀɴᴏʀᴏɴᴀʟᴅᴏ
┃ ✯│▢/ᴍᴇssɪ
┃ ✯│▢/ᴍᴇᴍᴇ
┃ ✯│▢/ɪᴛᴢʏ
┃ ✯│▢/ʙʟᴀᴄᴋᴘɪɴᴋ
┃ ✯│▢/ʟᴏʟɪᴠɪᴅ
┃ ✯│▢/ʟᴏʟɪ
┃ ✯│▢/ɴᴀᴠɪᴅᴀᴅ
┃ ✯│▢/ᴘᴘᴄᴏᴜᴘʟᴇ
┃ ✯│▢/ᴡᴘᴍᴏɴᴛᴀñᴀ
┃ ✯│▢/ᴘᴜʙɢ
┃ ✯│▢/ᴡᴘɢᴀᴍɪɴɢ
┃ ✯│▢/ᴡᴘᴀᴇsᴛʜᴇᴛɪᴄ
┃ ✯│▢/ᴡᴘᴀᴇsᴛʜᴇᴛɪᴄ2
┃ ✯│▢/ᴡᴘʀᴀɴᴅᴏᴍ
┃ ✯│▢/ᴡᴀʟʟʜᴘ
┃ ✯│▢/ᴡᴘᴠᴇʜɪᴄᴜʟᴏ
┃ ✯│▢/ᴡᴘᴍᴏᴛᴏ
┃ ✯│▢/ᴄᴏғғᴇᴇ
┃ ✯│▢/ᴘᴇɴᴛᴏʟ
┃ ✯│▢/ᴄᴀʀɪᴄᴀᴛᴜʀᴀ
┃ ✯│▢/ᴄɪʙᴇʀᴇsᴘᴀᴄɪᴏ
┃ ✯│▢/ᴛᴇᴄʜɴᴏʟᴏɢʏ
┃ ✯│▢/ᴅᴏʀᴀᴇᴍᴏɴ
┃ ✯│▢/ʜᴀᴄᴋᴇʀ
┃ ✯│▢/ᴘʟᴀɴᴇᴛᴀ
┃ ✯│▢/ʀᴀɴᴅᴏᴍᴘʀᴏғɪʟᴇ
┃ ✯│▢/ɴᴇᴋᴏ
┃ ✯│▢/ᴡᴀɪғᴜ
┃ ✯│▢/ᴀᴋɪʀᴀ
┃ ✯│▢/ᴀᴋɪʏᴀᴍᴀ
┃ ✯│▢/ᴀɴɴᴀ
┃ ✯│▢/ᴀsᴜɴᴀ
┃ ✯│▢/ᴀʏᴜᴢᴀᴡᴀ
┃ ✯│▢/ʙᴏʀᴜᴛᴏ
┃ ✯│▢/ᴄʜɪʜᴏ
┃ ✯│▢/ᴄʜɪᴛᴏɢᴇ
┃ ✯│▢/ᴅᴇɪᴅᴀʀᴀ
┃ ✯│▢/ᴇʀᴢᴀ
┃ ✯│▢/ᴇʟᴀɪɴᴀ
┃ ✯│▢/ᴇʙᴀ
┃ ✯│▢/ᴇᴍɪʟɪᴀ
┃ ✯│▢/ʜᴇsᴛɪᴀ
┃ ✯│▢/ʜɪɴᴀᴛᴀ
┃ ✯│▢/ɪɴᴏʀɪ
┃ ✯│▢/ɪsᴜᴢᴜ
┃ ✯│▢/ɪᴛᴀᴄʜɪ
┃ ✯│▢/ɪᴛᴏʀɪ
┃ ✯│▢/ᴋᴀɢᴀ
┃ ✯│▢/ᴋᴀɢᴜʀᴀ
┃ ✯│▢/ᴋᴀᴏʀɪ
┃ ✯│▢/ᴋᴇɴᴇᴋɪ
┃ ✯│▢/ᴋᴏᴛᴏʀɪ
┃ ✯│▢/ᴋᴜʀᴜᴍɪ
┃ ✯│▢/ᴍᴀᴅᴀʀᴀ
┃ ✯│▢/ᴍɪᴋᴀsᴀ
┃ ✯│▢/ᴍɪᴋᴜ
┃ ✯│▢/ᴍɪɴᴀᴛᴏ
┃ ✯│▢/ɴᴀʀᴜᴛᴏ
┃ ✯│▢/ɴᴇᴢᴜᴋᴏ
┃ ✯│▢/sᴀɢɪʀɪ
┃ ✯│▢/sᴀsᴜᴋᴇ
┃ ✯│▢/sᴀᴋᴜʀᴀ
┃ ✯│▢/ᴄᴏsᴘʟᴀʏ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯-𝐄𝐅𝐄𝐂𝐓𝐎𝐒 𝐃𝐄 𝐀𝐔𝐃𝐈𝐎𝐒-⦿
┃ ✯╭──────────◆
┃ ✯│▢𝐄𝐅𝐄𝐂𝐓𝐎𝐒 𝐃𝐄 𝐀𝐔𝐃𝐈𝐎𝐒
┃ ✯│▢/ʙᴀss
┃ ✯│▢/ʙʟᴏᴡɴ
┃ ✯│▢/ᴅᴇᴇᴘ
┃ ✯│▢/ᴇᴀʀʀᴀᴘᴇ
┃ ✯│▢/ғᴀsᴛ
┃ ✯│▢/ғᴀᴛ
┃ ✯│▢/ɴɪɢʜᴛᴄᴏʀᴇ
┃ ✯│▢/0ʀᴇᴠᴇʀsᴇ
┃ ✯│▢/ʀᴏʙᴏᴛ
┃ ✯│▢/sʟᴏᴡ
┃ ✯│▢/sᴍᴏᴏᴛʜ
┃ ✯│▢/ᴛᴜᴘᴀɪ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯--𝐂𝐇𝐀𝐓 𝐀𝐍𝐎𝐍𝐈𝐌𝐎--⦿
┃ ✯╭──────────◆
┃ ✯│▢/sᴛᴀʀᴛ
┃ ✯│▢/ɴᴇxᴛ
┃ ✯│▢/ʟᴇᴀᴠᴇ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯----𝐁𝐔𝐒𝐂𝐀𝐃𝐎𝐑𝐄𝐒----⦿
┃ ✯╭──────────◆
┃ ✯│▢/ᴍᴏᴅᴀᴘᴋ➟ᴛᴇxᴛᴏ
┃ ✯│▢/sᴛɪᴄᴋᴇʀsᴇᴀʀᴄʜ➟ᴛᴇxᴛᴏ
┃ ✯│▢/sᴛɪᴄᴋᴇʀsᴇᴀʀᴄʜ2➟ᴛᴇxᴛᴏ
┃ ✯│▢/xɴxxsᴇᴀʀᴄʜ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴀɴɪᴍᴇɪɴғᴏ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ɢᴏᴏɢʟᴇ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʟᴇᴛʀᴀ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴡɪᴋɪᴘᴇᴅɪᴀ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʏᴛsᴇᴀʀᴄʜ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴘʟᴀʏsᴛᴏʀᴇ➟ᴛᴇxᴛᴏ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯--𝐇𝐄𝐑𝐑𝐀𝐌𝐈𝐄𝐍𝐓𝐀𝐒--⦿
┃ ✯╭──────────◆
┃ ✯️│▢/ᴄʜᴀᴛɢᴘᴛ➟ᴛᴇxᴛᴏ
┃ ✯│▢/️ᴅᴀʟʟ-ᴇ➟ᴛᴇxᴛᴏ
┃ ✯│▢/️sᴘᴀᴍᴡᴀ➟ɴᴜᴍᴇʀᴏ➟ᴛᴇxᴛᴏ➟ᴄᴀɴᴛɪᴅᴀᴅ
┃ ✯│▢/️ᴛᴀᴍᴀñᴏ➟ᴄᴀɴᴛɪᴅᴀᴅ➟ɪᴍᴀɢᴇɴ➟ᴠɪᴅᴇᴏ
┃ ✯│▢/️ᴄʟɪᴍᴀ➟ᴘᴀís➟ᴄɪᴜᴅᴀᴅ
┃ ✯│▢/️ᴇɴᴄᴜᴇsᴛᴀ➟ᴛᴇxᴛᴏ1|ᴛᴇxᴛᴏ2...
┃ ✯│▢/️ᴀғᴋ➟ᴍᴏᴛɪᴠᴏ
┃ ✯│▢/️ᴏᴄʀ➟ʀᴇsᴘᴏɴᴅᴇ➟ᴀ➟ɪᴍᴀɢᴇɴ
┃ ✯️│▢/ᴀᴄᴏʀᴛᴀʀ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/️ᴄᴀʟᴄ➟ᴏᴘᴇʀᴀᴄɪᴏɴ➟ᴍᴀᴛʜ
┃ ✯│▢/️ᴅᴇʟ➟ᴍᴇɴsᴀᴊᴇ
┃ ✯│▢/️ᴡʜᴀᴛᴍᴜsɪᴄ➟ᴀᴜᴅɪᴏ
┃ ✯│▢/️ʀᴇᴀᴅǫʀ➟ɪᴍᴀɢᴇɴ➟ǫʀ
┃ ✯│▢/️ǫʀᴄᴏᴅᴇ➟ᴛᴇxᴛᴏ
┃ ✯️│▢/ʀᴇᴀᴅᴍᴏʀᴇ➟ᴛᴇxᴛᴏ1| ᴛᴇxᴛᴏ2
┃ ✯│▢/sᴛʏʟᴇᴛᴇxᴛᴛ➟ᴇxᴛᴏ
┃ ✯│▢/ᴛʀᴀᴅᴜᴄɪʀ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ɴᴏᴡᴀ➟ɴᴜᴍᴇʀᴏ
┃ ✯│▢/ᴄᴏᴠɪᴅ➟ᴘᴀɪs
┃ ✯│▢/ʜᴏʀᴀʀɪᴏ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯----𝐄𝐒𝐓𝐈𝐊𝐄𝐑𝐒 ----⦿
┃ ✯╭──────────◆
┃ ✯│▢/sᴛɪᴄᴋᴇʀ➟ʀᴇsᴘᴏɴᴅᴇʀ➟ᴀ➟ɪᴍᴀɢᴇɴ➟ᴏ➟ᴠɪᴅᴇᴏ
┃ ✯│▢/sᴛɪᴄᴋᴇʀ➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/s➟ʀᴇsᴘᴏɴᴅᴇʀ➟ɪᴍᴀɢᴇɴ➟ᴏ➟ᴠɪᴅᴇᴏ
┃ ✯│▢/s➟ᴇɴʟᴀᴄᴇ➟ʟɪɴᴋ
┃ ✯│▢/sғᴜʟʟ➟ɪᴍᴀɢᴇɴ➟ᴏ➟ᴠɪᴅᴇᴏ
┃ ✯│▢/ᴇᴍᴏᴊɪᴍɪx➟ᴇᴍᴏᴊɪ➟1&ᴇᴍᴏᴊɪ 2
┃ ✯│▢/sᴄɪʀᴄʟᴇ➟ɪᴍᴀɢᴇɴ
┃ ✯│▢/sʀᴇᴍᴏᴠᴇʙɢ➟ɪᴍᴀɢᴇɴ
┃ ✯│▢/sᴇᴍᴏᴊɪ➟ᴛɪᴘᴏ➟ᴇᴍᴏᴊɪ
┃ ✯│▢/ᴀᴛᴛᴘ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴀᴛᴛᴘ2➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴀᴛᴛᴘ3➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴛᴛᴘ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴛᴛᴘ2➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴛᴛᴘ3➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴛᴛᴘ4➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴛᴛᴘ5➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴘᴀᴛ➟@ᴛᴀɢ
┃ ✯│▢/sʟᴀᴘ➟@ᴛᴀɢ
┃ ✯│▢/ᴋɪss➟@ᴛᴀɢ
┃ ✯│▢/ᴅᴀᴅᴏ
┃ ✯│▢/ᴡᴍ➟ᴘᴀᴄᴋɴᴀᴍᴇ➟ᴀᴜᴛʜᴏʀ
┃ ✯│▢/sᴛɪᴄᴋᴇʀᴍᴀʀᴋᴇʀ➟ᴇғᴇᴄᴛᴏ➟ɪᴍᴀɢᴇɴ
┃ ✯│▢/sᴛɪᴄᴋᴇʀғɪʟᴛᴇʀ➟ᴇғᴇᴄᴛᴏ➟ɪᴍᴀɢᴇɴ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷
╭─────────────◆ 
┃✯----𝐎𝐖𝐍𝐄𝐑----⦿
┃ ✯╭──────────◆
┃ ✯│▢/sᴇᴛᴘʀᴇғɪx➟ᴘʀᴇғɪᴊᴏ
┃ ✯│▢/ʀᴇsᴇᴛᴘʀᴇғɪx
┃ ✯│▢/ᴀᴜᴛᴏᴀᴅᴍɪɴ
┃ ✯│▢/ʟᴇᴀᴠᴇɢᴄ
┃ ✯│▢/ʙʟᴏᴄᴋʟɪsᴛ
┃ ✯│▢/ʙʟᴏᴄᴋ➟@ᴛᴀɢ➟ɴᴜᴍᴇʀᴏ
┃ ✯│▢/ᴜɴʙʟᴏᴄᴋ➟@ᴛᴀɢ➟ɴᴜᴍᴇʀᴏ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ʀᴇsᴛʀɪᴄᴛ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ʀᴇsᴛʀɪᴄᴛ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀᴜᴛᴏʀᴇᴀᴅ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀᴜᴛᴏʀᴇᴀᴅ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴘᴜʙʟɪᴄ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴘᴜʙʟɪᴄ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴘᴄᴏɴʟʏ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴘᴄᴏɴʟʏ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ɢᴄᴏɴʟʏ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ɢᴄᴏɴʟʏ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴄᴀʟʟ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴄᴀʟʟ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴀɴᴛɪᴘʀɪᴠᴀᴅᴏ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴀɴᴛɪᴘʀɪᴠᴀᴅᴏ
┃ ✯│▢/ᴇɴᴀʙʟᴇ➟ᴍᴏᴅᴇᴊᴀᴅɪʙᴏᴛ
┃ ✯│▢/ᴅɪsᴀʙʟᴇ➟ᴍᴏᴅᴇᴊᴀᴅɪʙᴏᴛ
┃ ✯│▢/ᴍsɢ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʙᴀɴᴄʜᴀᴛ
┃ ✯│▢/ᴜɴʙᴀɴᴄʜᴀᴛ
┃ ✯│▢/ʙᴀɴᴜsᴇʀ➟@ᴛᴀɢ
┃ ✯│▢/ᴜɴʙᴀɴᴜsᴇʀ➟@ᴛᴀɢ
┃ ✯│▢/ᴅᴀʀᴅɪᴀᴍᴀɴᴛᴇs➟@ᴛᴀɢ
┃ ✯│▢/ᴀñᴀᴅɪʀxᴘ➟@ᴛᴀɢ
┃ ✯│▢/ʙᴀɴᴜsᴇʀ➟@ᴛᴀɢ
┃ ✯│▢/ʙᴄ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʙᴄᴄʜᴀᴛs➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʙᴄɢᴄ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ʙᴄɢᴄ2➟ᴀᴜᴅɪᴏ
┃ ✯│▢/ʙᴄɢᴄ2➟ᴠɪᴅᴇᴏ
┃ ✯│▢/ʙᴄɢᴄ2➟ɪᴍᴀɢᴇɴ
┃ ✯│▢/ʙᴄʙᴏᴛ➟ᴛᴇxᴛᴏ
┃ ✯│▢/ᴄʟᴇᴀʀᴛᴘᴍ
┃ ✯│▢/ʀᴇsᴛᴀʀᴛ
┃ ✯│▢/ᴜᴘᴅᴀᴛᴇ
┃ ✯│▢/ʙᴀɴʟɪsᴛ
┃ ✯│▢/ᴀᴅᴅᴘʀᴇᴍ➟@ᴛᴀɢ
┃ ✯│▢/ᴅᴇʟᴘʀᴇᴍ➟@ᴛᴀɢ
┃ ✯│▢/ʟɪsᴛᴘʀᴇᴍ
┃ ✯│▢/ʟɪsᴛᴄᴍᴅ
┃ ✯│▢/sᴇᴛᴘᴘʙᴏᴛ➟ʀᴇsᴘᴏɴᴅᴇʀ➟ᴀ➟ɪᴍᴀɢᴇɴ
┃ ✯│▢/ᴀᴅᴅᴄᴍᴅ➟ᴛᴇxᴛᴏ➟ʀᴇsᴘᴏɴᴅᴇʀ➟ᴀ➟sᴛɪᴄᴋᴇʀ➟ɪᴍᴀɢᴇɴ
┃ ✯│▢/ᴅᴇʟᴄᴍᴅ➟ʀᴇsᴘᴏɴᴅᴇʀ➟ᴀ➟sᴛɪᴄᴋᴇʀ➟ɪᴍᴀɢᴇɴ➟ᴄᴏɴ➟ᴄᴏᴍᴀɴᴅᴏ➟ᴏ➟ᴛᴇxᴛᴏ➟ᴀsɪɢɴᴀᴅᴏ
┃ ✯╰───────────◆
╰━━━━━━━━━━━──⊷`.trim() 
 
 ┣━━━❰･ *OWNER 👑* ･❱━━━┫ 
 ❀••►☪︎ PARA VER LOS COMANDOS DE OWNER USE: 
 ❀••►☪︎ ${usedPrefix}soloparaelpropietario 
 𒅄 ▬▬▬▬ ◆ ▬▬▬▬ 𒅄 

  ╔═════ REPORTAR ═════╗  
 ║ ❒ _*Reporta con este comando de haber*_ 
 ║ ❒ _*Fallas para poder Solucionar!!*_ 
 ║════════════════════════ 
 ║︎ ❒ _${usedPrefix}reporte *texto*_ 
 ║ ❒ _${usedPrefix}report *texto*_ 
 ╚════ ≪ •❈• ≫ ════╝ 
  
 ─━─━─━∞◆∞━─━─━─ 
 ❒ 𝐁𝐨𝐭𝐀𝐱𝐱𝐜`.trim();
 
 await  conn.sendMessage(m.chat,{ image:{ url:"https://telegra.ph/file/dde9bd1f999297449d139.jpg", }, caption: completomenu, 
contextInfo: { mentionedJid: [m.sender], externalAdReply: { title: `MENU - COMPLETO`, 
sourceUrl: "http://paypal.me/DorratBotOficial", mediaType: 1, showAdAttribution: true, thumbnailUrl: "https://telegra.ph/file/dde9bd1f999297449d139.jpg", 
}, }, }, { quoted: m,});}};
         
  handler.command = [
  "menu",
  "menú",
  "menucompleto",
  "allmenu"
  ];
  handler.tags = ["internet"]  
  export default handler 
  
  function clockString(ms) { 
   const h = isNaN(ms) ? "--" : Math.floor(ms / 3600000); 
   const m = isNaN(ms) ? "--" : Math.floor(ms / 60000) % 60; 
   const s = isNaN(ms) ? "--" : Math.floor(ms / 1000) % 60; 
   return [h, m, s].map((v) => v.toString().padStart(2, 0)).join(":"); 
 } 
  
 function ucapan() { 
   const time = moment.tz("America/Los_Angeles").format("HH"); //America/Los_Angeles  Asia/Jakarta   America/Toronto 
  
   var res = "🌉Buenas madrugadas"; 
  
   if (time >= 4) { 
     res = "🌇Buenos Días"; 
   } 
  
   if (time >= 11) { 
     res = "🏙️Buenas Tardes"; 
   } 
  
   if (time >= 15) { 
     res = "🌆Buenas tardes"; 
   } 
  
   if (time >= 17) { 
     res = "🌃Buenas noches"; 
   } 
  
   return res; 
 }
